# ResetSupportPosition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..ResetSupportPosition Method
Railing Class See Also
---
Resets the continuous rails support subelements position data.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ResetSupportPosition()
```

Visual Basic
---
```text
Public Sub ResetSupportPosition
```

Visual C++
---
```text
public:
void ResetSupportPosition()
```

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace